import time
import sys

"""
Cada asiento está asociado al rut de la persona que lo usará
"""

asientos = [
[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33], # f
[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33], # e
[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33], # d

[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33], # c
[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33], # b
[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]  # a
]

asientos = {
    "1b": "20439684"
    "2b": "20439684"
}


def print_asientos():
    for fila in range(len(asientos)):
        linea = ""
        if fila == 0:
            linea += "F: "
        elif fila == 1:
            linea += "E: "
        elif fila == 2:
            linea += "D: "
        elif fila == 3:
            linea += "C: "
        elif fila == 4:
            linea += "B: "
        elif fila == 5:
            linea += "A: "
        for asiento in asientos[fila]:
            linea += "[" + str(asiento) + "] "
        print(linea)
        if fila == 2:
            print()

print_asientos()
    
input()
